solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf1550/fsl_pf1550.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_PF1550_H_
#define _FSL_PF1550_H_

/*******************************************************************************
 * Includes
 ******************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include "fsl_common.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief PF1550 Default I2C address. */
#define PF1550_DEFAULT_I2C_ADDR 0x08U

/*! @brief Define the Register Memory Map of PF1550. */
/*! PMIC Register Memory Map. */
#define PF1550_DEVICE_ID         0x00U
#define PF1550_OTP_FLAVOR        0x01U
#define PF1550_SILICON_REV       0x02U
#define PF1550_INT_CATEGORY      0x06U
#define PF1550_SW_INT_STAT0      0x08U
#define PF1550_SW_INT_MASK0      0x09U
#define PF1550_SW_INT_SENSE0     0x0AU
#define PF1550_SW_INT_STAT1      0x0BU
#define PF1550_SW_INT_MASK1      0x0CU
#define PF1550_SW_INT_SENSE1     0x0DU
#define PF1550_SW_INT_STAT2      0x0EU
#define PF1550_SW_INT_MASK2      0x0FU
#define PF1550_SW_INT_SENSE2     0x10U
#define PF1550_LDO_INT_STAT0     0x18U
#define PF1550_LDO_INT_MASK0     0x19U
#define PF1550_LDO_INT_SENSE0    0x1AU
#define PF1550_TEMP_INT_STAT0    0x20U
#define PF1550_TEMP_INT_MASK0    0x21U
#define PF1550_TEMP_INT_SENSE0   0x22U
#define PF1550_ONKEY_INT_STAT0   0x24U
#define PF1550_ONKEY_INT_MASK0   0x25U
#define PF1550_ONKEY_INT_SENSE0  0x26U
#define PF1550_MISC_INT_STAT0    0x28U
#define PF1550_MISC_INT_MASK0    0x29U
#define PF1550_MISC_INT_SENSE0   0x2AU
#define PF1550_COINCELL_CONTROL  0x30U
#define PF1550_SW1_VOLT          0x32U
#define PF1550_SW1_STBY_VOLT     0x33U
#define PF1550_SW1_SLP_VOLT      0x34U
#define PF1550_SW1_CTRL          0x35U
#define PF1550_SW1_CTRL1         0x36U
#define PF1550_SW2_VOLT          0x38U
#define PF1550_SW2_STBY_VOLT     0x39U
#define PF1550_SW2_SLP_VOLT      0x3AU
#define PF1550_SW2_CTRL          0x3BU
#define PF1550_SW2_CTRL1         0x3CU
#define PF1550_SW3_VOLT          0x3EU
#define PF1550_SW3_STBY_VOLT     0x3FU
#define PF1550_SW3_SLP_VOLT      0x40U
#define PF1550_SW3_CTRL          0x41U
#define PF1550_SW3_CTRL1         0x42U
#define PF1550_VSNVS_CTRL        0x48U
#define PF1550_VREFDDR_CTRL      0x4AU
#define PF1550_LDO1_VOLT         0x4CU
#define PF1550_LDO1_CTRL         0x4DU
#define PF1550_LDO2_VOLT         0x4FU
#define PF1550_LDO2_CTRL         0x50U
#define PF1550_LDO3_VOLT         0x52U
#define PF1550_LDO3_CTRL         0x53U
#define PF1550_PWRCTRL0          0x58U
#define PF1550_PWRCTRL1          0x59U
#define PF1550_PWRCTRL2          0x5AU
#define PF1550_PWRCTRL3          0x5BU
#define PF1550_SW1_PWRDN_SEQ     0x5FU
#define PF1550_SW2_PWRDN_SEQ     0x60U
#define PF1550_SW3_PWRDN_SEQ     0x61U
#define PF1550_LDO1_PWRDN_SEQ    0x62U
#define PF1550_LDO2_PWRDN_SEQ    0x63U
#define PF1550_LDO3_PWRDN_SEQ    0x64U
#define PF1550_VREFDDR_PWRDN_SEQ 0x65U
#define PF1550_STATE_INFO        0x67U
#define PF1550_I2C_ADDR          0x68U
#define PF1550_IO_DRV0           0x69U
#define PF1550_IO_DRV1           0x6AU
#define PF1550_RC_16MHZ          0x6BU
#define PF1550_KEY1              0x6FU
/*! Charger Register Memory Map. */
#define PF1550_CHG_INT           0x80U
#define PF1550_CHG_INT_MASK      0x82U
#define PF1550_CHG_INT_OK        0x84U
#define PF1550_VBUS_SNS          0x86U
#define PF1550_CHG_SNS           0x87U
#define PF1550_BATT_SNS          0x88U
#define PF1550_CHG_OPER          0x89U
#define PF1550_CHG_TMR           0x8AU
#define PF1550_CHG_EOC_CNFG      0x8DU
#define PF1550_CHG_CURR_CNFG     0x8EU
#define PF1550_BATT_REG          0x8FU
#define PF1550_BATFET_CNFG       0x91U
#define PF1550_THM_REG_CNFG      0x92U
#define PF1550_VBUS_INLIM_CNFG   0x94U
#define PF1550_VBUS_LIN_DPM      0x95U
#define PF1550_USB_PHY_LDO_CNFG  0x96U
#define PF1550_DBNC_DELAY_TIME   0x98U
#define PF1550_CHG_INT_CNFG      0x99U
#define PF1550_THM_ADJ_SETTING   0x9AU
#define PF1550_VBUS2SYS_CNFG     0x9BU
#define PF1550_LED_PWM           0x9CU
#define PF1550_FAULT_BATFET_CNFG 0x9DU
#define PF1550_LED_CNFG          0x9EU
#define PF1550_CHGR_KEY2         0x9FU
/*! Test Register Memory Map. */
#define PF1550_KEY3    0xDFU
#define PF1550_FMRADDR 0xC4U
#define PF1550_FMRDATA 0xC5U
/*! OTP Register Memory Map. */
#define PF1550_OTP_SW1_SW2 0x1EU
#define PF1550_OTP_SW2_SW3 0x1FU

/*! @brief PF1550 Operating Status definition. */
typedef enum _pf1550_operating_status
{
    kPF1550_OperatingStatusCoreOff     = 0x1U, /* Indicates the state machine is in CoreOff Status. */
    kPF1550_OperatingStatusShipMode    = 0x2U, /* Indicates the state machine is in ShipMode Status. */
    kPF1550_OperatingStatusRegsDisable = 0x3U, /* Indicates the state machine is in RegsDisable Status. */
    kPF1550_OperatingStatusRun         = 0x4U, /* Indicates the state machine is in Run Status. */
    kPF1550_OperatingStatusStandby     = 0x5U, /* Indicates the state machine is in Standby Status. */
    kPF1550_OperatingStatusSleep       = 0x6U, /* Indicates the state machine is in Sleep Status. */
    kPF1550_OperatingStatusSystemOn    = 0x7U, /* Indicates the state machine is in any of the
                                                  SystemOn Status including Run, Standby, Sleep
                                                  and Low-Power. */
    kPF1550_OperatingStatusSystemOff = 0x8U,   /* Indicates the state machine is in any of the
                                                  SystemOff Status including RegsDisable, CoreOff
                                                  and ShipMode. */
} pf1550_operating_status_t;

/*! @brief PF1550 Sub-Module definition. */
typedef enum _pf1550_module
{
    kPF1550_ModuleSwitch1 = 0x0U, /* Switch1 Sub-Module Identifier. */
    kPF1550_ModuleSwitch2 = 0x1U, /* Switch2 Sub-Module Identifier. */
    kPF1550_ModuleSwitch3 = 0x2U, /* Switch3 Sub-Module Identifier. */
    kPF1550_ModuleLdo1    = 0x3U, /* LDO1 Sub-Module Identifier. */
    kPF1550_ModuleLdo2    = 0x4U, /* LDO2 Sub-Module Identifier. */
    kPF1550_ModuleLdo3    = 0x5U, /* LDO3 Sub-Module Identifier. */
    kPF1550_ModuleVsnvs   = 0x6U, /* VSNVS Sub-Module Identifier. */
    kPF1550_ModuleVrefDdr = 0x7U, /* Vref DDR Sub-Module Identifier. */
} pf1550_module_t;

/*! @brief PF1550 Interrupt Category definition. */
typedef enum _pf1550_interrupt_category
{
    kPF1550_IntCategoryCharger = 0x01U, /* Any of the Charger interrupt status bit is set. */
    kPF1550_IntCategorySwitch  = 0x0EU, /* Any of the Switch interrupt status bit is set. */
    kPF1550_IntCategoryLdo     = 0x10U, /* Any of the LDO interrupt status bit is set. */
    kPF1550_IntCategoryOnkey   = 0x20U, /* Any of the ONKEY interrupt status bit is set. */
    kPF1550_IntCategoryTemp    = 0x40U, /* Any of the PMIC junction temperature
                                           interrupt status bit is set. */
    kPF1550_IntCategoryMisc = 0x80U,    /* Any of the interrupts not covered by the above
                                           mentioned categories status bit is set. */
} pf1550_interrupt_category_t;

