solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf1550/fsl_pf1550.h
/*! @brief PF1550 Switch Interrupt Source definition. */
enum _pf1550_switch_interrupt_source
{
    kPF1550_IntSrcSw1LowSideCurrentLimit  = 0x1U,        /* Switch1 Low side current limit interrupt source. */
    kPF1550_IntSrcSw2LowSideCurrentLimit  = 0x2U,        /* Switch2 Low side current limit interrupt source. */
    kPF1550_IntSrcSw3LowSideCurrentLimit  = 0x4U,        /* Switch3 Low side current limit interrupt source. */
    kPF1550_IntSrcSw1HighSideCurrentLimit = 0x1U << 8U,  /* Switch1 High side current limit interrupt source. */
    kPF1550_IntSrcSw2HighSideCurrentLimit = 0x2U << 8U,  /* Switch2 High side current limit interrupt source. */
    kPF1550_IntSrcSw3HighSideCurrentLimit = 0x4U << 8U,  /* Switch3 High side current limit interrupt source. */
    kPF1550_IntSrcSw1DvsDone              = 0x1U << 16U, /* Switch1 DVS Complete interrupt source. */
    kPF1550_IntSrcSw2DvsDone              = 0x2U << 16U, /* Switch2 DVS Complete interrupt source. */
};

/*! @brief PF1550 LDO Interrupt Source definition. */
enum _pf1550_ldo_interrupt_source
{
    kPF1550_IntSrcLdo1CurrentLimit = 0x1U, /* LDO1 current limit interrupt source. */
    kPF1550_IntSrcLdo2CurrentLimit = 0x2U, /* LDO2 current limit interrupt source. */
    kPF1550_IntSrcLdo3CurrentLimit = 0x4U, /* LDO3 current limit interrupt source. */
};

/*! @brief PF1550 Die Temperature Interrupt Source definition. */
enum _pf1550_temp_interrupt_source
{
    kPF1550_IntSrcTemp_110C = 0x1U, /* Die temperature crosses 110C interrupt source. */
    kPF1550_IntSrcTemp_125C = 0x4U, /* Die temperature crosses 125C interrupt source. */
};

/*! @brief PF1550 ONKEY Interrupt Source definition. */
enum _pf1550_onkey_interrupt_source
{
    kPF1550_IntSrcOnkeyPush     = 0x01U, /* A push of the ONKEY button interrupt source. */
    kPF1550_IntSrcOnkeyPress_1s = 0x02U, /* After ONKEY pressed for >1s interrupt source. */
    kPF1550_IntSrcOnkeyPress_2s = 0x04U, /* After ONKEY pressed for >2s interrupt source. */
    kPF1550_IntSrcOnkeyPress_3s = 0x08U, /* After ONKEY pressed for >3s interrupt source. */
    kPF1550_IntSrcOnkeyPress_4s = 0x10U, /* After ONKEY pressed for >4s interrupt source. */
    kPF1550_IntSrcOnkeyPress_8s = 0x20U, /* After ONKEY pressed for >8s interrupt source. */
};

/*! @brief PF1550 Misc. Interrupt Source definition. */
enum _pf1550_misc_interrupt_source
{
    kPF1550_IntSrcMiscPowerUp = 0x01U,    /* Completion of transition from STANDBY to RUN
                                             and from SLEEP to RUN interrupt source. */
    kPF1550_IntSrcMiscPowerDown = 0x02U,  /* Completion of transition from RUN to STANDBY
                                             and from RUN to SLEEP interrupt source. */
    kPF1550_IntSrcMiscPowerOn = 0x04U,    /* Power on button event interrupt source
                                             (keep same function as PF3000/PF0100). */
    kPF1550_IntSrcMiscLowSysWarn = 0x08U, /* LOW_SYS_WARN threshold crossed interrupt source. */
    kPF1550_IntSrcMiscOverLoad   = 0x10U, /* SYS_OVLO threshold crossed interrupt source. */
};

/*! @brief PF1550 Undervoltage Detection Threshold definition. */
typedef enum _pf1550_undervoltage_detect_threshold
{
    kPF1550_UnderVoltDetThres_Rising2V65Falling2V55 =
        0x0U, /* Undervoltage Detection Threshold: Rising 2.65V; Falling 2.55V. */
    kPF1550_UnderVoltDetThres_Rising2V8Falling2V7 =
        0x1U, /* Undervoltage Detection Threshold: Rising 2.8V; Falling 2.7V. */
    kPF1550_UnderVoltDetThres_Rising3V0Falling2V9 =
        0x2U, /* Undervoltage Detection Threshold: Rising 3.0V; Falling 2.9V. */
    kPF1550_UnderVoltDetThres_Rising3V1Falling3V0 =
        0x3U, /* Undervoltage Detection Threshold: Rising 3.1V; Falling 3.0V. */
} pf1550_undervoltage_detect_threshold_t;

/*! @brief PF1550 Low Vsys Warning Threshold definition. */
typedef enum _pf1550_low_vsys_warning_threshold
{
    kPF1550_LowVsysWarnThres_Rising3V3Falling3V1 = 0x0U, /* Low Vsys Warning Threshold: Rising 3.3V; Falling 3.1V. */
    kPF1550_LowVsysWarnThres_Rising3V5Falling3V3 = 0x1U, /* Low Vsys Warning Threshold: Rising 3.5V; Falling 3.3V. */
    kPF1550_LowVsysWarnThres_Rising3V7Falling3V5 = 0x2U, /* Low Vsys Warning Threshold: Rising 3.7V; Falling 3.5V. */
    kPF1550_LowVsysWarnThres_Rising3V9Falling3V7 = 0x3U, /* Low Vsys Warning Threshold: Rising 3.9V; Falling 3.7V. */
} pf1550_low_vsys_warning_threshold_t;

/*! @brief PF1550 ONKEY Push Reset Time definition. */
typedef enum _pf1550_onkey_push_reset_time
{
    kPF1550_OnkeyPushResetTime_4s  = 0x0U, /* Push ONKEY 4s for a global reset. */
    kPF1550_OnkeyPushResetTime_8s  = 0x1U, /* Push ONKEY 8s for a global reset. */
    kPF1550_OnkeyPushResetTime_12s = 0x2U, /* Push ONKEY 12s for a global reset. */
    kPF1550_OnkeyPushResetTime_16s = 0x3U, /* Push ONKEY 16s for a global reset. */
} pf1550_onkey_push_reset_time_t;

/*! @brief PF1550 ONKEY Push Debounce Time definition. */
typedef enum _pf1550_onkey_debounce
{
    kPF1550_OnkeyDebounce_Falling31ms25Rising31ms25 =
        0x0U, /* ONKEY Push Debounce: 31.25ms falling edge; 31.25ms rising edge. */
    kPF1550_OnkeyDebounce_Falling125msRising31ms25 =
        0x2U, /* ONKEY Push Debounce: 125ms falling edge; 31.25ms rising edge. */
    kPF1550_OnkeyDebounce_Falling750msRising31ms25 =
        0x3U, /* ONKEY Push Debounce: 750ms falling edge; 31.25ms rising edge. */
} pf1550_onkey_debounce_t;

/*! @brief PF1550 Standby Delay Time definition. */
typedef enum _pf1550_standby_delay
{
    kPF1550_StandbyDelay_None         = 0x0U, /* No additional delay. */
    kPF1550_StandbyDelay_1x32kHzCycle = 0x1U, /* 1 x 32kHz cycle additional delay. */
    kPF1550_StandbyDelay_2x32kHzCycle = 0x2U, /* 2 x 32kHz cycle additional delay. */
    kPF1550_StandbyDelay_3x32kHzCycle = 0x3U, /* 3 x 32kHz cycle additional delay. */
} pf1550_standby_delay_t;

/*! @brief PF1550 Standby Pad Active Polarity definition. */
typedef enum _pf1550_standby_polarity
{
    kPF1550_StandbyPolActiveHigh = 0x0U, /* Standby pin input active high. */
    kPF1550_StandbyPolActiveLow  = 0x1U, /* Standby pin input active low. */
} pf1550_standby_polarity_t;

/*! @brief PF1550 Power Up Delay Time definition. */
typedef enum _pf1550_power_up_delay
{
    kPF1550_PowerUpDelay_2ms    = 0x0U, /* RESETBMCU goes high 2ms after last regulator. */
    kPF1550_PowerUpDelay_4ms    = 0x2U, /* RESETBMCU goes high 4ms after last regulator. */
    kPF1550_PowerUpDelay_8ms    = 0x3U, /* RESETBMCU goes high 8ms after last regulator. */
    kPF1550_PowerUpDelay_16ms   = 0x4U, /* RESETBMCU goes high 16ms after last regulator. */
    kPF1550_PowerUpDelay_128ms  = 0x5U, /* RESETBMCU goes high 128ms after last regulator. */
    kPF1550_PowerUpDelay_256ms  = 0x6U, /* RESETBMCU goes high 256ms after last regulator. */
    kPF1550_PowerUpDelay_1024ms = 0x7U, /* RESETBMCU goes high 1024ms after last regulator. */
} pf1550_power_up_delay_t;

/*! @brief PF1550 Power On Pad Debounce Time definition. */
typedef enum _pf1550_power_on_debounce
{
    kPF1550_PowerOnDebounce_Fall31ms25Rise31ms25 =
        0x0U, /* Power On Pad Debounce: 31.25ms falling edge; 31.25ms rising edge. */
    kPF1550_PowerOnDebounce_Fall125msRise31ms25 =
        0x2U, /* Power On Pad Debounce: 125ms falling edge; 31.25ms rising edge. */
    kPF1550_PowerOnDebounce_Fall750msRise31ms25 =
        0x3U, /* Power On Pad Debounce: 750ms falling edge; 31.25ms rising edge. */
} pf1550_power_on_debounce_t;

/*! @brief PF1550 Regulator Power Down Sequence Attribute definition. */
typedef enum _pf1550_regulator_power_down_sequence
{
    kPF1550_RegulatorPowerDownSeqOpt0 = 0x0U, /* Regulator Power Down Sequence Attribute: Option 0. */
    kPF1550_RegulatorPowerDownSeqOpt1 = 0x1U, /* Regulator Power Down Sequence Attribute: Option 1. */
    kPF1550_RegulatorPowerDownSeqOpt2 = 0x2U, /* Regulator Power Down Sequence Attribute: Option 2. */
    kPF1550_RegulatorPowerDownSeqOpt3 = 0x3U, /* Regulator Power Down Sequence Attribute: Option 3. */
    kPF1550_RegulatorPowerDownSeqOpt4 = 0x4U, /* Regulator Power Down Sequence Attribute: Option 4. */
    kPF1550_RegulatorPowerDownSeqOpt5 = 0x5U, /* Regulator Power Down Sequence Attribute: Option 5. */
    kPF1550_RegulatorPowerDownSeqOpt6 = 0x6U, /* Regulator Power Down Sequence Attribute: Option 6. */
    kPF1550_RegulatorPowerDownSeqOpt7 = 0x7U, /* Regulator Power Down Sequence Attribute: Option 7. */
} pf1550_regulator_power_down_sequence_t;

/*! @brief PF1550 Switch DVS Speed Attribute definition. */
typedef enum _pf1550_switch_dvs_speed
{
    kPF1550_SwitchDvsSpeed_12mV5Per2us = 0x0U, /* Switch DVS rate at 12.5mV/2us. */
    kPF1550_SwitchDvsSpeed_12mV5Per4us = 0x1U, /* Switch DVS rate at 12.5mV/4us. */
} pf1550_switch_dvs_speed_t;

/*! @brief PF1550 Switch Current Limit Attribute definition. */
typedef enum _pf1550_switch_current_limit
{
    kPF1550_SwitchCurrentLimit_1A  = 0x0U, /* Switch Current Limit: Typical current limit of 1.0A. */
    kPF1550_SwitchCurrentLimit_1A5 = 0x1U, /* Switch Current Limit: Typical current limit of 1.5A. */
    kPF1550_SwitchCurrentLimit_2A  = 0x2U, /* Switch Current Limit: Typical current limit of 2.0A. */
} pf1550_switch_current_limit_t;

