solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf1550/fsl_pf1550.h
/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization function
 * @{
 */

/*!
 * @brief Gets the default configuration structure.
 *
 * This function initializes the PF1550 configuration structure to default values. The default
 * values are as follows.
 *   pf1550Config->I2C_SendFunc              = NULL;
 *   pf1550Config->I2C_ReceiveFunc           = NULL;
 *   pf1550Config->threshold                 = kPF1550_UnderVoltDetThres_Rising3V0Falling2V9;
 *   pf1550Config->delay                     = kPF1550_PowerUpDelay_2ms;
 *   pf1550Config->shutDownLdoInCurrentFault = false;
 *   pf1550Config->slaveAddress              = PF1550_DEFAULT_I2C_ADDR;
 *
 * @param config Pointer to the PF1550 configuration structure.
 */
void PF1550_GetDefaultConfig(pf1550_config_t *config);

/*!
 * @brief Initializes a PF1550 instance.
 *
 * This function initializes the PF1550 module with user-defined settings.
 * This example shows how to set up the pf1550_config_t parameters and how
 * to call the PF1550_Init function by passing in these parameters.
 * @code
 *   pf1550_config_t pf1550Config;
 *   pf1550Config.I2C_SendFunc              = APP_I2C_SendFunc;
 *   pf1550Config.I2C_ReceiveFunc           = APP_I2C_ReceiveFunc;
 *   pf1550Config.threshold                 = kPF1550_UnderVoltDetThres_Rising3V1Falling3V0;
 *   pf1550Config.delay                     = kPF1550_PowerUpDelay_1024ms;
 *   pf1550Config.shutDownLdoInCurrentFault = true;
 *   pf1550Config.slaveAddress              = PF1550_DEFAULT_I2C_ADDR;
 *   PF1550_Init(&pf1550Handle, &pf1550Config);
 * @endcode
 *
 * @param handle PF1550 Handle.
 * @param config Pointer to the user-defined configuration structure.
 */
void PF1550_Init(pf1550_handle_t *handle, const pf1550_config_t *config);
/*! @} */

/*!
 * @name Basic register access functions
 * @{
 */

/*!
 * @brief Write the value to register of PF1550.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param reg variable store address of register.
 * @param val variable store value which is written to PF1550.
 * @return true if success or false if error.
 */
bool PF1550_WriteReg(pf1550_handle_t *handle, uint8_t reg, uint8_t val);

/*!
 * @brief Read the value of register in PF1550.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param reg variable store address of register.
 * @param val pointer store return value.
 * @return true if success or false if error.
 */
bool PF1550_ReadReg(pf1550_handle_t *handle, uint8_t reg, uint8_t *val);

/*!
 * @brief Modify some bits in the register in PF1550.
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param reg variable store address of register.
 * @param mask The mask code for the bits want to write. The bit you want to write should be 1.
 * @param val Value needs to write into the register.
 * @return true if success or false if error.
 */
bool PF1550_ModifyReg(pf1550_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val);

/*!
 * @brief Dump the register content in PF1550.
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param reg The address of the first register to dump.
 * @param buffer The buffer to store the dumped content.
 * @param size The count of registers to dump.
 * @return true if success or false if error.
 */
bool PF1550_DumpReg(pf1550_handle_t *handle, uint8_t reg, uint8_t *buffer, uint8_t size);

/*! @} */

/*!
 * @name Interrupts
 * @{
 */

/*!
 * @brief Enables PF1550 interrupts according to the provided interrupt source mask.
 *
 * This function enables the PF1550 interrupts according to the provided interrupt category
 * and interrupt source.
 * The interrupt source category enumerate the available interrupt groups in category.
 * The interrupt source mask is a logical OR of enumeration members:
 * see @ref _pf1550_switch_interrupt_source for Switch interrupt sources;
 *     @ref _pf1550_ldo_interrupt_source for LDO interrupt sources;
 *     @ref _pf1550_temp_interrupt_source for Die Temperature interrupt sources;
 *     @ref _pf1550_onkey_interrupt_source for ONKEY interrupt sources;
 *     @ref _pf1550_misc_interrupt_source for Misc. interrupt sources.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param category The interrupt category to set.
 * @param source Logic ORed interrupt sources of selected interrupt category to enable.
 */
void PF1550_EnableInterrupts(pf1550_handle_t *handle, pf1550_interrupt_category_t category, uint32_t source);

/*!
 * @brief Disable PF1550 interrupts according to the provided interrupt source mask.
 *
 * This function disables the PF1550 interrupts according to the provided interrupt category
 * and interrupt source.
 * The interrupt source category enumerate the available interrupt groups in category.
 * The interrupt source mask is a logical OR of enumeration members:
 * see @ref _pf1550_switch_interrupt_source for Switch interrupt sources;
 *     @ref _pf1550_ldo_interrupt_source for LDO interrupt sources;
 *     @ref _pf1550_temp_interrupt_source for Die Temperature interrupt sources;
 *     @ref _pf1550_onkey_interrupt_source for ONKEY interrupt sources;
 *     @ref _pf1550_misc_interrupt_source for Misc. interrupt sources.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param category The interrupt category to set.
 * @param source Logic ORed interrupt sources of selected interrupt category to disable.
 */
void PF1550_DisableInterrupts(pf1550_handle_t *handle, pf1550_interrupt_category_t category, uint32_t source);

/*!
 * @brief Get Interrupt Category of PF1550.
 * This function is used to get the ORed Interrupt Category
 * that is asserted by hardware. Users can AND the return value with
 * Interrupt Category defined in @ pf1550_interrupt_category_t to check
 * which kinds of interrupt event is happened, after that user can get/clear
 * the interrupt status bits for the specified interrupt category, other than
 * check all the interrupt status.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @return ORed Interrupt Category combination.
 */
uint32_t PF1550_GetInterruptCategory(pf1550_handle_t *handle);

/*!
 * @brief Get interrupt flags of selected interrupt category.
 *
 * This function gets all interrupt flags of selected interrupt category.
 * The flags are returned as the logical OR value of the corresponding interrupt source:
 * see @ref _pf1550_switch_interrupt_source for Switch interrupt sources;
 *     @ref _pf1550_ldo_interrupt_source for LDO interrupt sources;
 *     @ref _pf1550_temp_interrupt_source for Die Temperature interrupt sources;
 *     @ref _pf1550_onkey_interrupt_source for ONKEY interrupt sources;
 *     @ref _pf1550_misc_interrupt_source for Misc. interrupt sources.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param category The interrupt category that to query.
 * @return status flags which are ORed by the enumerators in the corresponding interrupt source.
 */
uint32_t PF1550_GetInterruptStatus(pf1550_handle_t *handle, pf1550_interrupt_category_t category);

/*!
 * @brief Clear interrupt flags of selected interrupt category.
 *
 * This function clears all interrupt flags of selected interrupt category.
 * The interrupt source category enumerate the available interrupt groups in category.
 * The interrupt source mask is a logical OR of enumeration members:
 * see @ref _pf1550_switch_interrupt_source for Switch interrupt sources;
 *     @ref _pf1550_ldo_interrupt_source for LDO interrupt sources;
 *     @ref _pf1550_temp_interrupt_source for Die Temperature interrupt sources;
 *     @ref _pf1550_onkey_interrupt_source for ONKEY interrupt sources;
 *     @ref _pf1550_misc_interrupt_source for Misc. interrupt sources.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param category The interrupt category that set.
 * @param source Logic ORed interrupt sources of selected interrupt category to clear.
 */
void PF1550_ClearInterruptStatus(pf1550_handle_t *handle, pf1550_interrupt_category_t category, uint32_t source);
/*! @} */

/*!
 * @name Regulator control functions
 * @{
 */

/*!
 * @brief Enable/Disable the output of selected regulator.
 *
 * This function is used to enable/disable the output of selected regulator
 * enumerated in @ref pf1550_module_t under selected operating status
 * enumerated in @ref pf1550_operating_status_t. The output state of
 * the regulators will change automatically once the operating status
 * changed.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param status The operating status of PF1550 to set.
 * @param enable Set true to enable regulator, set false to disable regulator.
 */
void PF1550_EnableRegulator(pf1550_handle_t *handle,
                            pf1550_module_t module,
                            pf1550_operating_status_t status,
                            bool enable);

/*!
 * @brief Query the output state of selected regulator.
 *
 * This function is used to query the output state of selected regulator
 * enumerated in @ref pf1550_module_t under selected operating status
 * enumerated in @ref pf1550_operating_status_t. The output state of
 * the regulators will change automatically once the operating status
 * changed.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param status The operating status of PF1550 to set.
 * @return true if regulator is enabled, false if regulator is disabled.
 */
bool PF1550_IsRegulatorEnabled(pf1550_handle_t *handle, pf1550_module_t module, pf1550_operating_status_t status);

/*!
 * @brief Set the output voltage of selected regulator.
 *
 * This function is used to set the output voltage of selected regulator
 * enumerated in @ref pf1550_module_t under selected operating status
 * enumerated in @ref pf1550_operating_status_t. The output state of
 * the regulators will change automatically once the operating status
 * changed. All the available output voltages are listed in
 * @ref pf1550_regulator_output_voltage_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param status The operating status of PF1550 to set.
 * @param voltage The output voltage in uV to set.
 */
void PF1550_SetRegulatorOutputVoltage(pf1550_handle_t *handle,
                                      pf1550_module_t module,
                                      pf1550_operating_status_t status,
                                      uint32_t voltage);

/*!
 * @brief Query the output voltage of selected regulator.
 *
 * This function is used to query the output voltage of selected regulator
 * enumerated in @ref pf1550_module_t under selected operating status
 * enumerated in @ref pf1550_operating_status_t. The output state of
 * the regulators will change automatically once the operating status
 * changed. All the available output voltages are listed in
 * @ref pf1550_regulator_output_voltage_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param status The operating status of PF1550 to set.
 * @return voltage The output voltage in uV of selected regulator.
 */
uint32_t PF1550_GetRegulatorOutputVoltage(pf1550_handle_t *handle,
                                          pf1550_module_t module,
                                          pf1550_operating_status_t status);

/*!
 * @brief Set the attributes of selected Buck Switch.
 *
 * This function is used to set the attributes of Buck Switch regulator.
 * All the available attributes for Switch are listed in
 * @ref pf1550_switch_attribute_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param attribute Pointer to the Switch Attribute structure to set.
 */
void PF1550_SetSwitchAttribute(pf1550_handle_t *handle,
                               pf1550_module_t module,
                               const pf1550_switch_attribute_t *attribute);

/*!
 * @brief Set the attributes of selected LDO.
 *
 * This function is used to set the attributes of LDO regulator.
 * All the available attributes for Switch are listed in
 * @ref pf1550_ldo_attribute_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param attribute Pointer to the LDO Attribute structure to set.
 */
void PF1550_SetLdoAttribute(pf1550_handle_t *handle, pf1550_module_t module, const pf1550_ldo_attribute_t *attribute);

/*!
 * @brief Set the attributes of Vref DDR.
 *
 * This function is used to set the attributes of Vref DDR regulator.
 * All the available attributes for Vref DDR are listed in
 * @ref pf1550_vrefddr_attribute_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param attribute Pointer to the Vref DDR Attribute structure to set.
 */
void PF1550_SetVrefDdrAttribute(pf1550_handle_t *handle, const pf1550_vrefddr_attribute_t *attribute);

/*!
 * @brief Set the attributes of Vsnvs.
 *
 * This function is used to set the attributes of Vsnvs regulator.
 * All the available attributes for Vsnvs are listed in
 * @ref pf1550_vsnvs_attribute_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param attribute Pointer to the Vsnvs Attribute structure to set.
 */
void PF1550_SetVsnvsAttribute(pf1550_handle_t *handle, const pf1550_vsnvs_attribute_t *attribute);
/*! @} */

/*!
 * @name I/O Pad control functions
 * @{
 */

/*!
 * @brief Set the attributes of ONKEY Pad.
 *
 * This function is used to set the attributes of ONKEY Pad.
 * All the available attributes for ONKEY Pad are listed in
 * @ref pf1550_onkey_attribute_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param attribute Pointer to the ONKEY Pad Attribute structure to set.
 */
void PF1550_SetOnKeyPadAttibute(pf1550_handle_t *handle, const pf1550_onkey_attribute_t *attribute);

/*!
 * @brief Set the attributes of PowerOn Pad.
 *
 * This function is used to set the attributes of PowerOn Pad.
 * All the available attributes for PowerOn Pad are listed in
 * @ref pf1550_power_on_attribute_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param attribute Pointer to the PowerOn Pad Attribute structure to set.
 */
void PF1550_SetPwrOnPadAttibute(pf1550_handle_t *handle, const pf1550_power_on_attribute_t *attribute);

/*!
 * @brief Set the attributes of Standby Pad.
 *
 * This function is used to set the attributes of Standby Pad.
 * All the available attributes for Standby Pad are listed in
 * @ref pf1550_standby_attribute_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @param attribute Pointer to the Standby Pad Attribute structure to set.
 */
void PF1550_SetStandbyPadAttibute(pf1550_handle_t *handle, const pf1550_standby_attribute_t *attribute);
/*! @} */

/*!
 * @name Misc. functions
 * @{
 */

/*!
 * @brief Query Current Operating Status of PF1550.
 *
 * This function is used to query the current operating status of PF1550.
 * All the available operating status for PF1550 are listed in
 * @ref pf1550_operating_status_t.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @return Current PF1550 operating status.
 */
pf1550_operating_status_t PF1550_GetOperatingStatus(pf1550_handle_t *handle);

/*!
 * @brief Query if regulator support dynamic voltage scaling.
 *
 * This function is used to query if the regulator support DVS feature.
 * User can only set the output voltage to the regulators that support
 * DVS feature, otherwise PF1550_SetRegulatorOutputVoltage() function will
 * return immediately.
 *
 * @param handle Pointer to a valid PF1550 instance structure.
 * @param module Sub-modules in PF1550 device.
 * @return true: regulator support DVS feature, false: regulator does not support DVS.
 */
bool PF1550_IsRegulatorSupportDvs(pf1550_handle_t *handle, pf1550_module_t module);
/*! @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_PF1550_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
